[
    {
        "title": "❓What is Venuestart?",
        "description": "Venuestart is a booking and sales management platform that connects venues with corporate and group event organizers across the Philippines."
    },
    {
        "title": "❓How is Venuestart different from other platforms?",
        "description": "Venuestart is a Philippines-based platform built specifically for the local events and hospitality market. Unlike generic listing sites, we actively promote your venue through direct B2B sales, agency partnerships, and targeted campaigns. Beyond listing, we help you close more deals — including group room bookings, inspection support, and full coordination from inquiry to event day."
    },
    {
        "title": "❓Can I pause or temporarily deactivate my listing?",
        "description": "Yes. You can pause availability anytime via your dashboard — your venue data remains intact."
    },
    {
        "title": "❓Do I need to sign a long-term contract?",
        "description": "No contract is required. You can join or leave the platform anytime with no lock-in"
    },
    {
        "title": "❓How much commission does Venuestart charge hosts?",
        "description": "Commission rates vary depending on the type of service (venue rental, catering, etc.) and will be discussed during onboarding."
    },
    {
        "title": "❓When do I receive my earnings?",
        "description": "Payment schedules may vary depending on your agreement with the client and the services involved. Typically, full or partial prepayment is collected before the event, with the balance — if any — settled afterward. Additional on-site charges (e.g., extended hours, extra services) may be paid directly by the client. We are flexible and can accommodate the payment process based on your preferred method, as long as terms are clearly arranged in advance and reflected in the quotation or billing documents."
    },
    {
        "title": "❓How do I respond to inquiries or bookings?",
        "description": "You’ll be notified by email and dashboard alerts. You can send quotes, answer questions, or request more details before confirming."
    },
    {
        "title": "❓I need help setting up my venue – who can I talk to?",
        "description": "Our coordinator team is here to assist you. You can contact us anytime through the following channels: Email:sales@venuestart.comPhone:+63-2-8651-9000Viber/WhatsApp:+63-917-123-4567"
    }
]


